/******************************************************************
请编写一个程序，该程序能够输出"hello world！"，要求抽象为一个函数的
形式
*******************************************************************
算法思想：
	将一串字符作为参数，函数将字符串输出。
	(不过抽象函数，还真不懂)
******************************************************************/
#include<stdio.h>
int output(char *str)
{
	int i = 0;
	while( str[i]!='\0' )
	{
		printf("%c",str[i]);
		i++;
	}
	printf("\n");
	return 0;
}
int main()
{
	char str[] = "Hellow world! ";
	output(str);
	output("Hellow %d \n world! ");
	return 0;
}